Documents/Заявка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<Name>Заявка</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.омг_НоменклатураЗаявокДляПриемов</xr:Item>
				<xr:Item>InformationRegister.омг_НоменклатураИКлиентыПоСтраховым</xr:Item>
				<xr:Item>InformationRegister.омг_НоменклатураЗаявок</xr:Item>
				<xr:Item>InformationRegister.омг_ЗанятоеВремяЗаявок</xr:Item>
				<xr:Item>AccumulationRegister.омг_НоменклатураЗаявокДляОказаний</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КомментарийДокумента</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Перенесенная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НесколькоСотрудников</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыСостоянийЗаявок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеДляОтката</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыСостоянийЗаявок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кабинет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Оборудование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Групповая</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийКлиента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХочуРаньше</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПримечаниеХочуРаньше</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтборХочуРаньше</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеЗаписиВРасписание</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимДлительностиЗаявки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РежимДлительностиЗаявки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>омг_ЭтоПервичныйПрием</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>омг_СтраховаяПрограмма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СоглашенияСтрахования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>омг_Прейскурант</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Прейскуранты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>омг_БезЗаписи</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Омг_СостояниеПоПриемам</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыСостоянийЗаявок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>омг_ОказаниеУслуг</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОказаниеУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>омг_ЭтоОперация</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>омг_bookingCode</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Омг_bookingId</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>омг_ПричинаПовтораСтраховых</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>омг_СтатусПредоплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.омг_СтатусыПредоплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОМГ_ПричинаОтсутствияПредоплаты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОМГ_ПричинаОтсутствияПредоплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникБронирования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Работы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Продолжительность</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Оборудование1</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Оборудование</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Оборудование2</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Оборудование</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Оборудование3</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Оборудование</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПродолжительностьИзмененаВручную</Name>
							<Comment>Используется в форме заявки при установке нормативной продолжительности</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>омг_НаправившийВрач</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>омг_Набор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>омг_НаборУровень</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>омг_БезЗаписиНесколькоВрачей</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>омг_НаборЛИС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>омг_SlotId</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Клиенты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Клиент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОтборыХочуРаньше</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Фильтр</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
								<v8:Type>cfg:CatalogRef.КатегорииВыработки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>омг_МедПерсонал</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Роль</Name>
							<Type>
								<v8:Type>cfg:EnumRef.омг_РолиПерсонала</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ОшибкиОбменовДанными.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>ОшибкиОбменовДанными</Name>
			<Comment>(ОЛИМП)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Обработан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОбработки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Заявка</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЗначенияСвойствОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияСвойствОбъектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.СвойстваОбъектов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Заявка</v8:Type>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Свойство</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СвойстваОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/РежимыЗаписиНаПрием.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>РежимыЗаписиНаПрием</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>КВрачу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВКабинет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВКабинетКВрачу</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/Заявка/Ext/ObjectModule.bsl
#Область ПеременныеМодуля

Перем мНеДелатьПроверокПриЗаписи Экспорт; // Предназначена для записи заявки без проверки наложений, корректности
                                          // данных, (например, при смене состояния заявки из других объектов
                                          // конфигурации.

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Процедура отменяет заявку
// Параметры:
//  ПроверитьПричинуОтмены - Булево - По умолчанию Истина.
//
Процедура ОтменитьЗаявку(ПроверитьПричинуОтмены = Истина, СостояниеОтмены = Неопределено) Экспорт
	
	Если Не ПометкаУдаления Тогда
		Если ПроверитьПричинуОтмены Тогда
			КалендарьПланирования.ДобавитьВЗаявкуОтметкуНеобходимостиУказанияПричины(ЭтотОбъект);
		КонецЕсли;
		СостояниеДляОтката = Состояние;
		Состояние = ?(ЗначениеЗаполнено(СостояниеОтмены), СостояниеОтмены, Справочники.ВидыСостоянийЗаявок.Отменена);
		
		Попытка 
			// Изменено Макеев (
			Если Проведен Тогда
				ЭтотОбъект.Записать(РежимЗаписиДокумента.Проведение);
			Иначе
				ЭтотОбъект.Записать();
			КонецЕсли;
			// )
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Операция не выполнена!'"));
			Состояние = СостояниеДляОтката;
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если не ОбменДанными.Загрузка Тогда

	Если Не ПометкаУдаления Тогда
		РаботаСДокументамиСервер.ОбработкаПроведенияДокументов(ЭтотОбъект,Отказ,РежимПроведения);
	КонецЕсли;
	
	Если не РольДоступна("ПолныеПрава") и РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда 
		
		Если омг_ДополнительныеАлгоритмы.ПроверитьДокументыНаОсновании(ЭтотОбъект.Ссылка) Тогда
			
			Сообщить("На основании заявки созданы документы. Отмена проведения запрещена!",СтатусСообщения.ОченьВажное);
			Отказ = Истина;
			
		КонецЕсли;	
		
	КонецЕсли; 

	Если Отказ Тогда Возврат КонецЕсли;
	
	Если ЭтотОбъект.Ссылка.Пустая() и не ЭтотОбъект.ПометкаУдаления и РежимЗаписи = РежимЗаписиДокумента.Запись Тогда
		РежимЗаписи = РежимЗаписиДокумента.Проведение
	КонецЕсли;	
			
	ЗаявкаОтменена = ПометкаУдаления Или УправлениеЗаявками.СостоянияЗаявкиОтменена().Найти(Состояние) <> Неопределено;
	
	#Область ОбработкаДанныхПередЗаписью // Операции дозаполнения перед записью.
	Если ДатаОкончания <> (КонецДня(ДатаНачала) + 1) Тогда 
		ДатаОкончания = НачалоДня(ДатаНачала) + ОбщегоНазначения.ВремяВСекунды(ДатаОкончания);
	КонецЕсли;
	
	// Заполнение реквизитов ДатаНачала и ДатаОкончания т.ч. работы.
	УпорядочитьРаботыСПустойПродолжительностью();
	текДатаНачала = ДатаНачала;  
	
	/////////////////////////////////////////////////////////////////////////////////
	// ОМГ     
	
	Если не РольДоступна("ПолныеПрава") и РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда 
		
		Если омг_ДополнительныеАлгоритмы.ПроверитьДокументыНаОсновании(ЭтотОбъект.Ссылка) Тогда
			
			Сообщить("На основании заявки созданы документы. Отмена проведения запрещена!",СтатусСообщения.ОченьВажное);
			Отказ = Истина;
			
		КонецЕсли;	
		
	КонецЕсли; 


	мУчетнаяПолитика = УправлениеНастройками.ПолучитьУчетнуюПолитику();
	Для Каждого СтрРаботы Из Работы Цикл 
		
		Если не НесколькоСотрудников Тогда 
		СтрРаботы.ДатаНачала	= текДатаНачала;
		СтрРаботы.ДатаОкончания	= СтрРаботы.ДатаНачала + ОбщегоНазначения.ВремяВСекунды(СтрРаботы.Продолжительность);
		текДатаНачала = СтрРаботы.ДатаОкончания;
		КонецЕсли;
		
		Если омг_БезЗаписи или СтрРаботы.Сотрудник = мУчетнаяПолитика.омг_ВрачПоУмолчанию и НесколькоСотрудников  Тогда 
		СтрРаботы.Продолжительность = '00010101';
		СтрРаботы.ДатаНачала =  НачалоДня(СтрРаботы.ДатаНачала) + Час(мУчетнаяПолитика.ВремяНачалаРаботы) *60*60;
		СтрРаботы.ДатаОкончания = СтрРаботы.ДатаНачала;
		СтрРаботы.омг_БезЗаписиНесколькоВрачей = Истина;
	КонецЕсли;
	
	Если СтрРаботы.омг_БезЗаписиНесколькоВрачей Тогда
		СтрРаботы.омг_БезЗаписиНесколькоВрачей = ?(не омг_БезЗаписи и не НесколькоСотрудников,Ложь,Истина); 
	КонецЕсли;
	
	КонецЦикла;
	
	// ОМГ
	/////////////////////////////////////////////////////////////////////////////////

	// Таблица работ
	ТабРаботы = Работы.Выгрузить();
	ИспользованиеКабинетов = УправлениеНастройками.ПолучитьПараметрУчетнойПолитики("РежимЗаписиНаПрием") <> Перечисления.РежимыЗаписиНаПрием.КВрачу;
	Для Каждого СтрРаботы Из ТабРаботы Цикл
		Если Не ЗначениеЗаполнено(СтрРаботы.Сотрудник) Тогда
			СтрРаботы.Сотрудник = Сотрудник;
		КонецЕсли;
		Если ИспользованиеКабинетов И НесколькоСотрудников Тогда
			Если Не ЗначениеЗаполнено(СтрРаботы.Оборудование1) Тогда
				СтрРаботы.Оборудование1 = Кабинет;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	#КонецОбласти
		
	Если Не ЗаявкаОтменена И мНеДелатьПроверокПриЗаписи <> Истина Тогда
		
		МетаданныеДокумента = Метаданные();
		
		СпЗнач = Новый СписокЗначений;
		Если ДатаНачала > ДатаОкончания Тогда
			СпЗнач.Добавить(НСтр("ru='Время окончания заявки меньше времени начала. Некорректно указано время заявки!'"));
		КонецЕсли;
		
		РежимЗаписиНаПрием = УправлениеНастройками.ПолучитьПараметрУчетнойПолитики("РежимЗаписиНаПрием");
		// Контроль заполнения сотрудников
		Если РежимЗаписиНаПрием <> Перечисления.РежимыЗаписиНаПрием.ВКабинет Тогда
			спПредупрежденияНеуказанияСотрудниковВТЧ = Новый Массив;
			Для Каждого СтрРаботы Из ТабРаботы Цикл
				Если Не (ЗначениеЗаполнено(СтрРаботы.Номенклатура) И СтрРаботы.Номенклатура.ПланируетсяБезСотрудника) Тогда
					Если НесколькоСотрудников Тогда
						// Сразу проверяем на заполнение
						Если Не ЗначениеЗаполнено(СтрРаботы.Сотрудник) Тогда
							спПредупрежденияНеуказанияСотрудниковВТЧ.Добавить(СтрРаботы.НомерСтроки);
						КонецЕсли;
					ИначеЕсли Не ЗначениеЗаполнено(ЭтотОбъект.Сотрудник) Тогда
						СпЗнач.Добавить(СтрШаблон(НСтр("ru='Поле ""%1"" не заполнено'"), МетаданныеДокумента.Реквизиты["Сотрудник"].Синоним));
						Прервать;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		ПерваяКолонкаОборудованияКабинет = НесколькоСотрудников И РежимЗаписиНаПрием <> Перечисления.РежимыЗаписиНаПрием.КВрачу;
		флЕстьРаботыБезКабинета = Ложь;
		Для Каждого СтрокаРаботы Из ТабРаботы Цикл
		    стр = ПроцедурыСпециализацииПоставки.ПолучитьЗначенияОборудования(СтрокаРаботы.Номенклатура, ЭтотОбъект[ПроцедурыСпециализацииПоставки.ИмяРеквизитаФилиалДокументов()]);
			
			Для Инд = 1 По ?(ПерваяКолонкаОборудованияКабинет,2,3) Цикл
				Если ТипЗнч(стр["Оборудование" + Инд]) = Тип("СправочникСсылка.МоделиОборудования") 
					И Не ЗначениеЗаполнено(СтрокаРаботы["Оборудование" + (Инд + ?(ПерваяКолонкаОборудованияКабинет,1,0))]) 
				Тогда
					СпЗнач.Добавить(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Для работы %1 не заполнено кабинет/оборудование №%2.'"),СтрокаРаботы.Номенклатура,Инд));
				КонецЕсли;	
			КонецЦикла;
		КонецЦикла;
		
		Если СпЗнач.Количество() > 0 Тогда
			ОбщегоНазначения.СообщитьСписок(СпЗнач);	
			Отказ = Истина;
			Возврат;
		КонецЕсли;		
		
		Если УправлениеНастройками.ПолучитьПараметрУчетнойПолитики("РежимЗаписиНаПрием") <> Перечисления.РежимыЗаписиНаПрием.ВКабинет Тогда
			Для Каждого НомСтрПредупрежденияСотрудник из спПредупрежденияНеуказанияСотрудниковВТЧ Цикл
				ТекстСообщения = НСтр("ru='Не указан сотрудник в строке №%1.'");
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, НомСтрПредупрежденияСотрудник);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);			
				Отказ = Истина;
			КонецЦикла;
		КонецЕсли;
		
		// Проверка, нет ли уже заявки по клиенту на это время
		Если ДатаНачала <> ДатаОкончания
			И Не ОбменДанными.Загрузка  
	//////////////////////////////////////////////////////////////////////////////
	// ОМГ
	 и омг_БезЗаписи = Ложь  
	// ОМГ
	//////////////////////////////////////////////////////////////////////////////

		Тогда			
			ПроверитьНаложениеЗаявокКлиентов(Отказ);
		КонецЕсли;
		
	// Проверка наложения заявок сотрудников            
	//////////////////////////////////////////////////////////////////////////////
	// ОМГ Устарело.Теперь Используется Регистр сведений омг_ЗанятоеВремяЗаявок    
	
	Если Работы.Количество() <> 0 и омг_БезЗаписи = Ложь Тогда 
					
			ПроверитьНаложениеЗаявокСотрудников(Отказ, ТабРаботы.Скопировать());
			
			// Проверка, нет ли уже заявки по оборудованию на это время.
			РезультатНаложение = КалендарьПланирования.ПроверкаНаложенияЗаявокОборудования(ТабРаботы.Скопировать(),ДатаНачала,ДатаОкончания,ЭтотОбъект,ИспользованиеКабинетов);
			Если РезультатНаложение <> Неопределено Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Ошибка записи документа'") );
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Нельзя записать заявку, т.к. на необходимые для работ кабинеты/оборудование на данный период уже имеются заявки:'") );
				Для Каждого стр Из РезультатНаложение Цикл
					ТекстСообщения = НСтр("ru='   %1 - %2, сотрудник: %3
						|      на %4: %5-%6'") ;
				    ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения,
						Строка(стр.Оборудование), Строка(стр.Заявка), стр.Сотрудник,
						Формат(стр.ДатаНачала,"ДФ=dd.MM.yyyy"), Формат(стр.ВремяНачала,"ДФ=HH:mm"), Формат(стр.ВремяОкончания,"ДФ=HH:mm"));
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				КонецЦикла;
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;
	// ОМГ
	//////////////////////////////////////////////////////////////////////////////	
		// Если есть ошибки при проверке, но это загрузку нового документа из внешнего источника,
		Если Отказ
			И ОбменДанными.Загрузка
			И ЭтоНовый()
		Тогда
			ЗаписатьПроблемнуюЗаявкуИзВнешнегоИсточника(Отказ);
		КонецЕсли;
	КонецЕсли;
	
	Если УправлениеЗаявками.СостоянияЗаявкиДоПродажиИлиВыполнения().Найти(Состояние) <> Неопределено Тогда // Состояние до использования автосостояний.
		СостояниеДляОтката = Состояние;
	КонецЕсли;
	
	Если Не Отказ Тогда
		ДополнительныеСвойства.Вставить("СостояниеПредыдущее", Ссылка.Состояние);
	КонецЕсли;
	
	//////////////////////////////////////////////////////////////////////////////
	// ОМГ 
	
	//Если не омг_БезЗаписи  Тогда   
		ОпределениеНеобходимостиОбновленияЖурналаЗаписи();
	//КонецЕсли;    
	
	//Если Не Отказ Тогда 
	//	
	//	Для каждого строка из Работы Цикл
	//		
	//		Если строка.Количество = 0 Тогда
	//			 строка.Количество = 1
	//		КонецЕсли;
	//		
	//	КонецЦикла;	
	//				
	//КонецЕсли;	
		
	
		// ОМГ
	//////////////////////////////////////////////////////////////////////////////

	КонецЕсли;

КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если Не Отказ Тогда
		УправлениеЗаявками.ЗаписатьОповещенияОПриходеКлиентов(Ссылка, ДополнительныеСвойства); 
	КонецЕсли;
	
	Если Не Отказ И ХочуРаньше И УправлениеЗаявками.СостояниеЗаявкиРабочее(Состояние) Тогда
		Эталон = Константы.ДатаПоследнейЗаявкиХочуРаньше.Получить();
		Если Не ЗначениеЗаполнено(Эталон) ИЛИ НачалоДня(ДатаНачала) > Эталон Тогда
			Константы.ДатаПоследнейЗаявкиХочуРаньше.Установить(ДатаНачала);
		КонецЕсли;
	КонецЕсли;
	
	// Отметка выполнения листа ожидания-основания.
	Если ЗначениеЗаполнено(Основание) 
		И ТипЗнч(Основание) = Тип("ДокументСсылка.ЛистОжидания")
	Тогда
		Попытка
			CRMСервер.ОтметитьВыполнениеЛистаОжидания(Основание, Ссылка);
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	Если ПометкаУдаления
		Или УправлениеЗаявками.СостоянияЗаявкиОтменена().Найти(Состояние) <> Неопределено
	Тогда
		ВебИнтеграция.ПометитьКакПрочитанныйДокумент(Ссылка, Истина);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
		Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЛистОжидания") Тогда
				
		// Заполнение шапки
		Филиал	= ДанныеЗаполнения.Филиал;
		Клиент	= ДанныеЗаполнения.Клиент;
		Сотрудник	= ДанныеЗаполнения.Сотрудник;
		Ответственный	= ДанныеЗаполнения.Ответственный;
		Примечание		= ДанныеЗаполнения.Примечание;
		
		Основание = ДанныеЗаполнения;
		
		Для Каждого ТекСтрокаРаботы Из ДанныеЗаполнения.Работы Цикл
			НоваяСтрока = Работы.Добавить();
			НоваяСтрока.Номенклатура = ТекСтрокаРаботы.Номенклатура;
			НоваяСтрока.Продолжительность = УправлениеЗаявками.ПлановаяДлительностьУслуги(НоваяСтрока.Номенклатура);// ТекСтрокаРаботы.Продолжительность;
		КонецЦикла;
		
		СтрЖелаемоеВремя = Неопределено;
		Если ДанныеЗаполнения.ЖелаемоеВремя.Количество() = 1 Тогда
			СтрЖелаемоеВремя = ДанныеЗаполнения.ЖелаемоеВремя[0];
		ИначеЕсли ДанныеЗаполнения.ЖелаемоеВремя.Количество() > 1 Тогда
			Для Каждого СтрокаТабЧасти Из ДанныеЗаполнения.ЖелаемоеВремя Цикл 
				Если СтрокаТабЧасти.Дата >= НачалоДня(ТекущаяДата()) Тогда
					СтрЖелаемоеВремя = СтрокаТабЧасти;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		Если СтрЖелаемоеВремя <> Неопределено Тогда
			Если ЗначениеЗаполнено(СтрЖелаемоеВремя.Дата) Тогда
				ДатаНачала = СтрЖелаемоеВремя.Дата + ОбщегоНазначенияКлиентСервер.ВремяВСекунды(СтрЖелаемоеВремя.Начало);
				Если ДатаНачала <= ТекущаяДата() Тогда
					// За прошедший день нет смысла записывать - по-умолчанию поставляем завтраший.
					ДатаНачала = НачалоДня(ТекущаяДата()) + ОбщегоНазначенияКлиентСервер.ВремяВСекунды(СтрЖелаемоеВремя.Начало);
				КонецЕсли;
			Иначе
			    ДатаНачала = НачалоДня(ТекущаяДата()) + ОбщегоНазначенияКлиентСервер.ВремяВСекунды(СтрЖелаемоеВремя.Начало);
			КонецЕсли;
			ДатаОкончания = ДатаНачала;
			
			Для Каждого СтрокаРаботы Из Работы Цикл
				ДатаОкончания = ДатаОкончания + ОбщегоНазначенияКлиентСервер.ВремяВСекунды(СтрокаРаботы.Продолжительность);
			КонецЦикла;
			
			ВремяНачала		= СтрЖелаемоеВремя.Начало;
			ВремяОкончания  = Дата(1,1,1) + (ДатаОкончания - НачалоДня(ДатаОкончания));
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		
		Если ДанныеЗаполнения.Свойство("Клиент") Тогда
			Клиент = ДанныеЗаполнения.Клиент;
		КонецЕсли;
		
		Если ДанныеЗаполнения.Свойство("Сотрудник") Тогда
			Сотрудник = ДанныеЗаполнения.Сотрудник;
		КонецЕсли;
		
		Если ДанныеЗаполнения.Свойство("Работы") Тогда
			ДанныеЗаполненияРаботы = ДанныеЗаполнения.Работы;
		ИначеЕсли ДанныеЗаполнения.Свойство("Основание")
			И ТипЗнч(ДанныеЗаполнения.Основание) = Тип("ДокументСсылка.ЛистОжидания")
		Тогда
			ДанныеЗаполненияРаботы = ДанныеЗаполнения.Основание.Работы;
		КонецЕсли;
		
		Если ДанныеЗаполненияРаботы <> Неопределено Тогда
			Для Каждого ДанныеРаботы Из ДанныеЗаполненияРаботы Цикл
				СтрокаРаботы = Работы.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаРаботы, ДанныеРаботы);
				СтрокаРаботы.Продолжительность = УправлениеЗаявками.ПлановаяДлительностьУслуги(СтрокаРаботы.Номенклатура);
			КонецЦикла;
		КонецЕсли;
			
		Если Не ЗначениеЗаполнено(Сотрудник) Тогда
			Для Каждого СтрокаРаботы Из Работы Цикл
				Если ЗначениеЗаполнено(СтрокаРаботы.Сотрудник) Тогда
					Сотрудник = СтрокаРаботы.Сотрудник;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		Если Не ДанныеЗаполнения.Свойство("РежимДлительностиЗаявки")
			Или (Не ДанныеЗаполнения.РежимДлительностиЗаявки = Перечисления.РежимДлительностиЗаявки.Фиксированная И ДанныеЗаполнения.КоличествоВыбранныхЯчеек = 1)
		Тогда
			РежимДлительностиЗаявки = Перечисления.РежимДлительностиЗаявки.ПоНормам;
			
			Если Не ДанныеЗаполнения.Свойство("ДатаНачала") Тогда
				ДанныеЗаполнения.Вставить("ДатаНачала", ТекущаяДата());
				КалендарьПланирования.ОкруглитьВремяДоПериодаПланирования(ДанныеЗаполнения.ДатаНачала);
			КонецЕсли;
			Если Не ДанныеЗаполнения.Свойство("ВремяНачала") Тогда
				ДанныеЗаполнения.Вставить("ВремяНачала", ДанныеЗаполнения.ДатаНачала);
			КонецЕсли;
			
			ДанныеЗаполнения.Вставить("ВремяОкончания", ДанныеЗаполнения.ВремяНачала);
			ДанныеЗаполнения.Вставить("ДатаОкончания", ДанныеЗаполнения.ДатаНачала);
			
			Если Работы.Количество() <> 0 Тогда
				ПродолжительностьОбщая = 0;
				Для Каждого СтрокаРаботы Из Работы Цикл
					ПродолжительностьОбщая = ПродолжительностьОбщая + ОбщегоНазначения.ВремяВСекунды(СтрокаРаботы.Продолжительность);
				КонецЦикла;
				ДанныеЗаполнения.ВремяОкончания	 = ДанныеЗаполнения.ВремяОкончания	 + ПродолжительностьОбщая;
				ДанныеЗаполнения.ДатаОкончания	 = ДанныеЗаполнения.ДатаОкончания	 + ПродолжительностьОбщая;
			КонецЕсли;
			
			///////////////////////////////////////////////////////////////////////////////
			// ОМГ
			Если ДанныеЗаполнения.ВремяОкончания = ДанныеЗаполнения.ВремяНачала и ДанныеЗаполнения.ДатаОкончания = ДанныеЗаполнения.ДатаНачала Тогда
				
				СредняяПродолжительность = УправлениеНастройками.ПолучитьУчетнуюПолитику().ПериодичностьПланирования;
				Если  ДанныеЗаполнения.Свойство("СредняяПродолжительность") Тогда	
				Если ЗначениеЗаполнено(ДанныеЗаполнения.СредняяПродолжительность) Тогда
				СредняяПродолжительность = ДанныеЗаполнения.СредняяПродолжительность
				
				КонецЕсли;	
				КонецЕсли;
			ДанныеЗаполнения.ВремяОкончания = ДанныеЗаполнения.ВремяНачала + ОбщегоНазначения.ВремяВСекунды(СредняяПродолжительность);
			ДанныеЗаполнения.ДатаОкончания = ДанныеЗаполнения.ДатаОкончания + ОбщегоНазначения.ВремяВСекунды(СредняяПродолжительность);
				
			КонецЕсли;     
			
			// ОМГ
            ///////////////////////////////////////////////////////////////////////////////

			РежимДлительностиЗаявки = Перечисления.РежимДлительностиЗаявки.ПоНормам;
		Иначе
			РежимДлительностиЗаявки = Перечисления.РежимДлительностиЗаявки.Фиксированная;
			Если ДанныеЗаполнения.КоличествоВыбранныхЯчеек = 1 
				И ДанныеЗаполнения.СредняяПродолжительность <> Дата(1,1,1)
			Тогда
				ДанныеЗаполнения.ВремяОкончания = ДанныеЗаполнения.ВремяНачала + ОбщегоНазначения.ВремяВСекунды(ДанныеЗаполнения.СредняяПродолжительность);
				ДанныеЗаполнения.ДатаОкончания = НачалоДня(ДанныеЗаполнения.ДатаНачала) + ОбщегоНазначения.ВремяВСекунды(ДанныеЗаполнения.ВремяОкончания);
			КонецЕсли;
		КонецЕсли;    
		
			Если  ДанныеЗаполнения.Свойство("Основание") Тогда	
				
				Если ТипЗнч(ДанныеЗаполнения.Основание) = Тип("ДокументСсылка.Событие")  Тогда
					
					Запрос = Новый Запрос;
					Запрос.Текст = 
					"ВЫБРАТЬ
					|	Событие.ВидПриема КАК омг_ЭтоПервичныйПрием,
					|	Событие.НаправлениеНовый КАК Направление,
					|	Событие.ТемаОбращенийУслуга КАК ТемаОбращенийУслуга,
					|	Событие.УслугиНетВПрайсе КАК УслугиНетВПрайсе,
					|	Событие.УслугаБезПрайса КАК УслугаБезПрайса
					|ИЗ
					|	Документ.Событие КАК Событие
					|ГДЕ
					|	Событие.Ссылка = &Ссылка
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	Работы.Номенклатура КАК Услуга
					|ИЗ
					|	Документ.Событие.Работы КАК Работы
					|ГДЕ
					|	Работы.Ссылка = &Ссылка
					|
					|СГРУППИРОВАТЬ ПО
					|	Работы.Номенклатура";
					
					Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения.Основание);
					
					РезультатЗапроса = Запрос.ВыполнитьПакет();
					
					ВыборкаДетальныеЗаписи = РезультатЗапроса[0].Выбрать(); 
					ВыборкаДетальныеЗаписи1 = РезультатЗапроса[1].Выбрать();
					
					ТекстКоментария = "";
					
					Если ВыборкаДетальныеЗаписи.Следующий() Тогда
						
						Если ВыборкаДетальныеЗаписи.омг_ЭтоПервичныйПрием = Перечисления.ВидыПриемов.Первичный Тогда	
							ТекстКоментария = " Это первичный прием." + Символы.ПС;
						иначеЕсли ВыборкаДетальныеЗаписи.омг_ЭтоПервичныйПрием = Перечисления.ВидыПриемов.Вторичный Тогда
							ТекстКоментария = " Это вторичный прием." + Символы.ПС;	
						КонецЕсли;	
						
						Если ВыборкаДетальныеЗаписи.Направление = Перечисления.ВидыНаправлений.Платно Тогда	
							ТекстКоментария = ТекстКоментария + " Платно." + Символы.ПС;
						иначеЕсли ВыборкаДетальныеЗаписи.Направление = Перечисления.ВидыНаправлений.Страховка Тогда
							ТекстКоментария = ТекстКоментария + " По страховке." + Символы.ПС;	
						КонецЕсли;	
						
						//ТекстКоментария = ТекстКоментария + " Тема обращений/Услуга: " + ВыборкаДетальныеЗаписи.ТемаОбращенийУслуга + Символы.ПС;
						
						//Если ВыборкаДетальныеЗаписи.УслугиНетВПрайсе Тогда	
						//	ТекстКоментария = ТекстКоментария + " Услуги нет в прайсе." + Символы.ПС;
						//иначе
						//	ТекстКоментария = ТекстКоментария + " Услуга есть в прайсе." + Символы.ПС;	
						//КонецЕсли;
						
						ТекстСпециализаций = "";
						
						Пока ВыборкаДетальныеЗаписи1.Следующий() Цикл
							
							//ТекстСпециализаций = ТекстСпециализаций + "- "+ВыборкаДетальныеЗаписи1.Услуга + Символы.ПС;
							
							СтрУслуги = ЭтотОбъект.Работы.Добавить();
							СтрУслуги.Номенклатура =  ВыборкаДетальныеЗаписи1.Услуга;
							СтрУслуги.Сотрудник =  ЭтотОбъект.Сотрудник;
                            СтрУслуги.Количество =  1;
							
							
						КонецЦикла;	
						
						//ТекстКоментария = ТекстКоментария + " Услуги: " + Символы.ПС + ТекстСпециализаций;
						
						//ТекстКоментария = ТекстКоментария + " Услуги без прайса: " + Символы.ПС + ВыборкаДетальныеЗаписи.УслугаБезПрайса + Символы.ПС;
						
					КонецЕсли;
					ЭтотОбъект.Примечание =  ТекстКоментария;
				КонецЕсли;	
				
			КонецЕсли;

	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Макеев 09-02-2026
	Если Состояние = Справочники.ВидыСостоянийЗаявок.Забронирована Тогда
		Индекс = ПроверяемыеРеквизиты.Найти("Клиент");
		Если Индекс <> Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("Клиент"));
		КонецЕсли;
	КонецЕсли;
	
	Если РольДоступна("омг_ОператорДополнительныеОграничения") И ЭтоНовый() Тогда
		ПроверяемыеРеквизиты.Добавить("Основание");
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаписатьПроблемнуюЗаявкуИзВнешнегоИсточника(Отказ)
	
	Отказ = Ложь;
	Состояние = Справочники.ВидыСостоянийЗаявок.Отменена;
	
	Если ЭтоНовый() Тогда
		СсылкаНаОбъект = ПолучитьСсылкуНового();
		Если СсылкаНаОбъект.Пустая() Тогда
			СсылкаНаОбъект = Документы.Заявка.ПолучитьСсылку(Новый УникальныйИдентификатор);
			УстановитьСсылкуНового(СсылкаНаОбъект);
		КонецЕсли;
	Иначе
		СсылкаНаОбъект = Ссылка;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	НаборЗаписей = РегистрыСведений.ОшибкиОбменовДанными.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Объект.Установить(СсылкаНаОбъект);
	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество() = 0 Тогда
		
		Описание = НСтр("ru='Заявка, полученная из ""%1"" не может быть записана в базу без ручной корректировки.'");
		Если ЗначениеЗаполнено(ОбменДанными.Отправитель) Тогда
			Источник = Строка(ОбменДанными.Отправитель);
		ИначеЕсли ДополнительныеСвойства.Свойство("ИсточникДокумента") Тогда
			Источник = ДополнительныеСвойства.ИсточникДокумента;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Источник) Тогда
			Описание = СтрШаблон(Описание, Источник);
			
			// Запись в регистр предупреждений
			Запись = НаборЗаписей.Добавить();
			Запись.Объект = СсылкаНаОбъект;
			Запись.Описание = Описание;
			Запись.ДатаРегистрации = ТекущаяДата();
			НаборЗаписей.Записать();
		КонецЕсли;
	КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Процедура ПроверитьНаложениеЗаявокСотрудников(Отказ, Знач ТабРаботы)
	
	Если не ОбменДанными.Загрузка Тогда
		
		флРазрыв  = Ложь;
		махОбрИнд = ТабРаботы.Количество()-1;
		Для сч = 0 По махОбрИнд Цикл
			ТекСтрока = ТабРаботы[махОбрИнд-сч];
			
			Если ЗначениеЗаполнено(ТекСтрока.Номенклатура) И ТекСтрока.Номенклатура.ПланируетсяБезСотрудника
				//////////////////////////////////////////////////////////////
				// омг
				или ТекСтрока.омг_БезЗаписиНесколькоВрачей
				// омг
				//////////////////////////////////////////////////////////////
				Тогда
				ТабРаботы.Удалить(ТекСтрока);
				флРазрыв = Истина;
			ИначеЕсли Не флРазрыв Тогда
				Если сч = махОбрИнд Тогда
					Продолжить;
				КонецЕсли;
				
				СтрокаВыше = ТабРаботы[махОбрИнд-сч-1];
				Если ТекСтрока.Сотрудник = СтрокаВыше.Сотрудник
					И Не (ЗначениеЗаполнено(СтрокаВыше.Номенклатура) И СтрокаВыше.Номенклатура.ПланируетсяБезСотрудника)
					//////////////////////////////////////////////////////////////
					// омг
					И  ТекСтрока.ДатаНачала = СтрокаВыше.ДатаОкончания
					// омг
					//////////////////////////////////////////////////////////////
					Тогда
					СтрокаВыше.ДатаОкончания = ТекСтрока.ДатаОкончания;
					ТабРаботы.Удалить(ТекСтрока);
				КонецЕсли;
				флРазрыв = Ложь;
			КонецЕсли;
		КонецЦикла;
		
		ТабПроверкиНаложений = ТабРаботы.Скопировать(,"Сотрудник, ДатаНачала, ДатаОкончания");
		
		спСотрудникаСВыведеннымиПредупреждениями = Новый СписокЗначений;
		Для Каждого СтрПроверки Из ТабПроверкиНаложений Цикл
			Если СтрПроверки.Сотрудник.Пустая() Тогда
				Продолжить;
			КонецЕсли;
			
			// Проверка, нет ли уже заявки по сотруднику на это время
			РезультатНаложение = КалендарьПланирования.ПроверкаНаложенияЗаявок(СтрПроверки.Сотрудник, СтрПроверки.ДатаНачала, СтрПроверки.ДатаОкончания, Ссылка);
			Если РезультатНаложение <> Неопределено
				И спСотрудникаСВыведеннымиПредупреждениями.НайтиПоЗначению(СтрПроверки.Сотрудник) = Неопределено
				Тогда
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Ошибка записи документа'"));
				
				ТекстСообщения = НСтр("ru='Нельзя записать заявку, т.к. по сотруднику %1 на данный период уже имеются заявки:'");
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, Строка(СтрПроверки.Сотрудник));
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				// Формируем текст, какая конкретно заявка, на какую дату и какой интервал времени.
				ТекстСообщения = НСтр("ru='   %1 
				|      на %2: %3-%4'");
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения,
				Строка(РезультатНаложение.Ссылка), Формат(РезультатНаложение.ДатаНачала,"ДФ=dd.MM.yyyy"), Формат(РезультатНаложение.ДатаНачала,"ДФ=HH:mm"),
				Формат(РезультатНаложение.ДатаОкончания,"ДФ=HH:mm"));
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				
				спСотрудникаСВыведеннымиПредупреждениями.Добавить(СтрПроверки.Сотрудник);
				Отказ = Истина;
				
			КонецЕсли;
		КонецЦикла;
		
		Если Не Отказ Тогда
			спСотрудникаСВыведеннымиПредупреждениями.Очистить();
			мСотрудники = Новый Массив;
			Для Каждого СтрПроверки Из ТабПроверкиНаложений Цикл
				Если Не СтрПроверки.Сотрудник.Пустая() Тогда
					мСотрудники.Добавить(СтрПроверки.Сотрудник);
				КонецЕсли;
			КонецЦикла;
			РабочееВремя = ГрафикиСотрудников.ПолучитьРабочееВремяЗаПериод(ДатаНачала, ДатаОкончания, Ложь, , Филиал, мСотрудники);
			Для Каждого СтрПроверки Из ТабПроверкиНаложений Цикл
				Если СтрПроверки.Сотрудник.Пустая() Тогда
					Продолжить;
				КонецЕсли;
				///////////////////////////////////
				//омг   
				Если НесколькоСотрудников Тогда
				омг_РабочееВремя = ГрафикиСотрудников.ПолучитьРабочееВремяЗаПериод(СтрПроверки.ДатаНачала, СтрПроверки.ДатаОкончания, Ложь, , Филиал, мСотрудники) иначе
					
					омг_РабочееВремя = РабочееВремя;
				КонецЕсли;		
				//омг
				////////////////////////////////////
				флОшибка = Истина;   
				///////////////////////////////////
				//омг  
				//Для Каждого СтрокаРабочегоВремени Из РабочееВремя.НайтиСтроки(Новый Структура("Сотрудник", СтрПроверки.Сотрудник)) Цикл   
				Для Каждого СтрокаРабочегоВремени Из омг_РабочееВремя.НайтиСтроки(Новый Структура("Сотрудник", СтрПроверки.Сотрудник)) Цикл  	
					//омг
					////////////////////////////////////
					
					Если СтрПроверки.ДатаНачала >= СтрокаРабочегоВремени.Дата + (СтрокаРабочегоВремени.ВремяНачала - Дата(1,1,1))
						И СтрПроверки.ДатаОкончания <= СтрокаРабочегоВремени.Дата + (СтрокаРабочегоВремени.ВремяОкончания - Дата(1,1,1))
						Тогда
						флОшибка = Ложь;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				
				Если флОшибка
					И спСотрудникаСВыведеннымиПредупреждениями.НайтиПоЗначению(СтрПроверки.Сотрудник) = Неопределено
					Тогда
					ТекстПредупреждения = СтрШаблон(НСтр("ru='Время выполнения работ по заявке выходит за границы рабочего дня сотрудника %1 в этот день!'"), Строка(СтрПроверки.Сотрудник));
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстПредупреждения);
					спСотрудникаСВыведеннымиПредупреждениями.Добавить(СтрПроверки.Сотрудник);
					
					// Если запрещено записывать на нерабочее время, то отказываем в записи заявки
					//Если Не ОбменДанными.Загрузка
					//	И УправлениеНастройками.ПолучитьПараметрУчетнойПолитики("ЗапретитьЗаписьНаНерабочееВремяСотрудника") = Истина
					//	И УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(,"ВсегдаРазрешатьЗаписыватьНаНерабочееВремяСотрудников") = Ложь
					//Тогда
					Отказ = Истина; // В учетной политике запрещено записывать на нерабочее время и у пользователя нет личного разрешения.
					//КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

Процедура ПроверитьНаложениеЗаявокКлиентов(Отказ)
	
	Если Не ОбменДанными.Загрузка
		И УправлениеНастройками.ПолучитьПараметрУчетнойПолитики("ЗапретитьЗаписьКлиентаНаДваПосещенияОдновременно") = Истина
	Тогда 
		РезультатНаложение = КалендарьПланирования.ПроверкаНаложенияЗаявокКлиента(Клиент, ДатаНачала, ДатаОкончания, Ссылка);
		Если РезультатНаложение <> Неопределено Тогда
			
			ТекстСообщения = НСтр("ru='Нельзя записать заявку, т.к. по клиенту %1 на данный период уже имеются заявки:'"); 
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения,
				Строка(Клиент));
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			
			Для Каждого СтрокаНаложение Из РезультатНаложение Цикл
				ТекстСообщения = НСтр("ru='   %1 
				|      на %2: %3-%4'"); 
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения,
					Строка(СтрокаНаложение.Ссылка), Формат(СтрокаНаложение.ДатаНачала,"ДФ=dd.MM.yyyy"),Формат(СтрокаНаложение.ДатаНачала,"ДФ=HH:mm"),
					Формат(СтрокаНаложение.ДатаОкончания,"ДФ=HH:mm")); 
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			КонецЦикла;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='В базе включен запрет на запись клиента несколькими заявками на одно время.'"));
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#Область ОпределениеНеобходимостиОбновленияЖурналаЗаписи

Процедура ОпределениеНеобходимостиОбновленияЖурналаЗаписи()
	
	Если Не ДополнительныеСвойства.Свойство("ЗаписьВФорме") Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоНовый() Тогда
		ДополнительныеСвойства.Вставить("ОповеститьОбИзмененииЗаявки", Истина);
		ДополнительныеСвойства.Вставить("ИзменилосьТолькоСостояние", Ложь);
	Иначе
		ПроверяемыеРеквизиты = РеквизитыВлияющиеНаЖурналЗаписи();
		ТекущиеЗначенияРеквизитов = ЗначенияРеквизитовВМассив(ПроверяемыеРеквизиты, ЭтотОбъект);
		СтарыеЗначенияРеквизитов  = ЗначенияРеквизитовВМассив(ПроверяемыеРеквизиты, Ссылка);
		
		ПоляЗаявкиИзменились = Не ОбщегоНазначения.КоллекцииИдентичны(ТекущиеЗначенияРеквизитов, СтарыеЗначенияРеквизитов);
		СостояниеИзменилось	 = Ссылка.Состояние <> ЭтотОбъект.Состояние;
		
		// Свойства объекта
		Если Не ПоляЗаявкиИзменились И ДополнительныеСвойства.Свойство("ЗначенияСвойствОбъекта") И ДополнительныеСвойства.ЗначенияСвойствОбъекта.Количество() > 0 Тогда
			НаборЗаписей = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Объект.Установить(Ссылка);
			НаборЗаписей.Прочитать();
			ПоляЗаявкиИзменились = Не ОбщегоНазначения.КоллекцииИдентичны(ДополнительныеСвойства.ЗначенияСвойствОбъекта.Скопировать(,"Значение,Свойство"), НаборЗаписей.Выгрузить(,"Значение,Свойство"));
		КонецЕсли;
		
		ДополнительныеСвойства.Вставить("ОповеститьОбИзмененииЗаявки", ПоляЗаявкиИзменились Или СостояниеИзменилось);
		ДополнительныеСвойства.Вставить("ИзменилосьТолькоСостояние", СостояниеИзменилось И Не ПоляЗаявкиИзменились);
	КонецЕсли;       
	
	
КонецПроцедуры

Функция РеквизитыВлияющиеНаЖурналЗаписи()
	
	ПроверяемыеРеквизиты = Новый Массив;
	ПроверяемыеРеквизиты.Добавить("Клиент");
	ПроверяемыеРеквизиты.Добавить("Сотрудник");
	ПроверяемыеРеквизиты.Добавить(ПроцедурыСпециализацииПоставки.ИмяРеквизитаФилиалДокументов());
	ПроверяемыеРеквизиты.Добавить("ДатаНачала");
	ПроверяемыеРеквизиты.Добавить("ДатаОкончания");
	ПроверяемыеРеквизиты.Добавить("ВремяНачала");
	ПроверяемыеРеквизиты.Добавить("ВремяОкончания");
	ПроверяемыеРеквизиты.Добавить("Примечание");
	ПроверяемыеРеквизиты.Добавить("КомментарийКлиента");
	
	МетаданныеДокумента = Метаданные();
	
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Групповая", МетаданныеДокумента) Тогда
		ПроверяемыеРеквизиты.Добавить("Групповая");
	КонецЕсли;
	
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Кабинет", МетаданныеДокумента) Тогда
		ПроверяемыеРеквизиты.Добавить("Кабинет");
	КонецЕсли;
	
	Возврат ПроверяемыеРеквизиты;
	
КонецФункции

Функция ЗначенияРеквизитовВМассив(ПроверяемыеРеквизиты, Заявка)
	
	МассивРеквизитов = Новый Массив;
	
	Для Каждого ПроверяемыйРеквизит Из ПроверяемыеРеквизиты Цикл
		МассивРеквизитов.Добавить(Заявка[ПроверяемыйРеквизит]);
	КонецЦикла;
	
	Возврат МассивРеквизитов;
	
КонецФункции

#КонецОбласти

Процедура УпорядочитьРаботыСПустойПродолжительностью()
	
	мОбработанныеСотрудники = Новый Массив;
	Для Каждого СтрокаРаботы Из Работы Цикл
		Если мОбработанныеСотрудники.Найти(СтрокаРаботы.Сотрудник) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		мОбработанныеСотрудники.Добавить(СтрокаРаботы.Сотрудник);
		Если Не ЗначениеЗаполнено(СтрокаРаботы.Продолжительность) Тогда
			РаботыСотрудника = Работы.НайтиСтроки(Новый Структура("Сотрудник", СтрокаРаботы.Сотрудник));
			ОбщегоНазначенияСервер.ВосстановитьПорядокНайденныхСтрок(РаботыСотрудника, Работы);
			Для Каждого СтрокаРаботыСотрудника Из РаботыСотрудника Цикл
				Если ЗначениеЗаполнено(СтрокаРаботыСотрудника.Продолжительность) Тогда
					Сдвиг = Работы.Индекс(СтрокаРаботыСотрудника) - Работы.Индекс(СтрокаРаботы);
					Работы.Сдвинуть(СтрокаРаботы, Сдвиг);
					Работы.Сдвинуть(СтрокаРаботыСотрудника, 1 - Сдвиг);
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если Не Отказ Тогда   	
		
		Набор = РегистрыСведений.омг_НоменклатураЗаявок.СоздатьНаборЗаписей(); 
		Если ЗначениеЗаполнено(Ссылка) Тогда 
			Набор.Отбор.Регистратор.Установить(Ссылка);		
			Набор.Записать(); 
		КонецЕсли;
		УникНомерСтрокиЗаявка = 1;
		Если не ПометкаУдаления Тогда 
			ТабРаботы = Работы.Выгрузить();
			ТабРаботы.Свернуть("Номенклатура","Количество");
			Для каждого строка из ТабРаботы Цикл
				Если ЗначениеЗаполнено(строка.Номенклатура) Тогда  
					НоваяЗапись = Набор.Добавить();
					НоваяЗапись.Период = Дата; 
					НоваяЗапись.ДатаРегистрации = Дата;
					
					НоваяЗапись.Номенклатура = строка.Номенклатура;
					НоваяЗапись.ДокРегистрации = Ссылка;
					НоваяЗапись.Филиал = ЭтотОбъект.Филиал;
					НоваяЗапись.омг_СтраховаяПрограмма = ЭтотОбъект.омг_СтраховаяПрограмма;
					
					НоваяЗапись.Клиент = Клиент; 
					НоваяЗапись.Врач = Сотрудник;
					НоваяЗапись.УникНомерСтрокиЗаявка = УникНомерСтрокиЗаявка; 
					Если строка.Количество = 1 Тогда
						НоваяЗапись.Количество = строка.Количество
					ИначеЕсли  строка.Количество < 1  Тогда
						НоваяЗапись.Количество = 1
					ИначеЕсли строка.Количество > 1 Тогда 
						НоваяЗапись.Количество = 1;
						КолУслуг = Окр(строка.Количество,0);	
						Для сч = 1 по КолУслуг-1 Цикл
							НоваяЗаписьСч = Набор.Добавить();
							ЗаполнитьЗначенияСвойств(НоваяЗаписьСч,НоваяЗапись);
							УникНомерСтрокиЗаявка = УникНомерСтрокиЗаявка +1;
							НоваяЗаписьСч.УникНомерСтрокиЗаявка = УникНомерСтрокиЗаявка;
						КонецЦикла;		
					КонецЕсли; 
				КонецЕсли; 
				УникНомерСтрокиЗаявка = УникНомерСтрокиЗаявка +1;
				
			КонецЦикла; 
			Набор.Записать(Истина); 
			
		КонецЕсли;
		
		омг_МедицинскаяДеятельность.КонтрольПоНоменклатуре(ЭтотОбъект);
		
	КонецЕсли;	
	
	омг_ЗанятоеВремяЗаявокДвижения = Истина;
	
	Организация  = омг_ДополнительныеАлгоритмы.омг_ВернутьОрганизациюПоФилиалу(ЭтотОбъект.Филиал);
	
	Если ЗначениеЗаполнено(Организация) Тогда
		
		Если омг_Предоплата.омг_ИспользуетсяПредоплата(Организация) Тогда
			
			СтатусОплаты = омг_Предоплата.ВернутьСтатусОплаты(ЭтотОбъект.Ссылка); 
			омг_Ссылка = Неопределено;
			
			Если ЗначениеЗаполнено(СтатусОплаты) Тогда
				
				омг_Ссылка = СтатусОплаты.Ссылка;
				
			КонецЕсли;  
			
			Если ЗначениеЗаполнено(ЭтотОбъект.ОМГ_ПричинаОтсутствияПредоплаты) или 
				ЗначениеЗаполнено(омг_Ссылка) Тогда
			иначе
				омг_ЗанятоеВремяЗаявокДвижения = Ложь;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;   
	
	Если омг_ЗанятоеВремяЗаявокДвижения Тогда
		// Добавлено Макеев (
		Движения.омг_ЗанятоеВремяЗаявок.Записывать = Истина;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	Заявка.Ссылка КАК Ссылка,
		|	ВЫБОР
		|		КОГДА Заявка.НесколькоСотрудников
		|			ТОГДА ЗаявкаРаботы.Сотрудник
		|		ИНАЧЕ Заявка.Сотрудник
		|	КОНЕЦ КАК Сотрудник,
		|	ВЫБОР
		|		КОГДА Заявка.НесколькоСотрудников
		|			ТОГДА ЗаявкаРаботы.ДатаНачала
		|		ИНАЧЕ Заявка.ДатаНачала
		|	КОНЕЦ КАК ДатаНачала,
		|	ВЫБОР
		|		КОГДА Заявка.НесколькоСотрудников
		|			ТОГДА ЗаявкаРаботы.ДатаОкончания
		|		ИНАЧЕ Заявка.ДатаОкончания
		|	КОНЕЦ КАК ДатаОкончания,
		|	Заявка.Филиал КАК Филиал
		|ПОМЕСТИТЬ ВТ_Работы
		|ИЗ
		|	Документ.Заявка.Работы КАК ЗаявкаРаботы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Заявка КАК Заявка
		|		ПО ЗаявкаРаботы.Ссылка = Заявка.Ссылка
		|ГДЕ
		|	Заявка.Ссылка = &Ссылка
		|	И НЕ Заявка.омг_БезЗаписи
		|	И НЕ Заявка.Состояние В (&СостоянияОтмены)
		|	И НЕ ЗаявкаРаботы.омг_БезЗаписиНесколькоВрачей
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Работы.Ссылка КАК Ссылка,
		|	ВТ_Работы.Сотрудник КАК Сотрудник,
		|	ВТ_Работы.ДатаНачала КАК ДатаНачала,
		|	ВТ_Работы.ДатаОкончания КАК ДатаОкончания,
		|	ВТ_Работы.Филиал КАК Филиал
		|ИЗ
		|	ВТ_Работы КАК ВТ_Работы
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Работы.Сотрудник,
		|	ВТ_Работы.Ссылка,
		|	ВТ_Работы.ДатаНачала,
		|	ВТ_Работы.ДатаОкончания,
		|	ВТ_Работы.Филиал";
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		СостоянияОтмены = Новый Массив;
		СостоянияОтмены.Добавить(Справочники.ВидыСостоянийЗаявок.Отменена);
		Запрос.УстановитьПараметр("СостоянияОтмены", УправлениеЗаявками.СостоянияЗаявкиОтменена());
		ВыборкаРаботы = Запрос.Выполнить().Выбрать();
		
		Пока ВыборкаРаботы.Следующий() Цикл
			Движение = Движения.омг_ЗанятоеВремяЗаявок.Добавить();
			ЗаполнитьЗначенияСвойств(Движение, ВыборкаРаботы);
		КонецЦикла;
		// )
	КонецЕсли;
	///////////////////////////////////////////////////////
	// омг_НоменклатураЗаявокДляОказаний и приемов        
	
	Движения.омг_НоменклатураЗаявокДляОказаний.Записывать = Истина;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаявкаРаботы.Номенклатура КАК Номенклатура,
	|	СУММА(ЗаявкаРаботы.Количество) КАК Количество,
	|	ЗаявкаРаботы.Ссылка.Дата КАК Период,
	|	&Заявка КАК Заявка,
	|	ВЫБОР
	|		КОГДА ЗаявкаРаботы.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|			ТОГДА ЗаявкаРаботы.Ссылка.Сотрудник
	|		ИНАЧЕ ЗаявкаРаботы.Сотрудник
	|	КОНЕЦ КАК Врач,
	|	ЗаявкаРаботы.омг_Набор КАК омг_Набор
	|ИЗ
	|	Документ.Заявка.Работы КАК ЗаявкаРаботы
	|ГДЕ
	|	ЗаявкаРаботы.Ссылка = &Заявка
	|	И НЕ ЗаявкаРаботы.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаявкаРаботы.Номенклатура,
	|	ЗаявкаРаботы.Ссылка.Дата,
	|	ВЫБОР
	|		КОГДА ЗаявкаРаботы.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|			ТОГДА ЗаявкаРаботы.Ссылка.Сотрудник
	|		ИНАЧЕ ЗаявкаРаботы.Сотрудник
	|	КОНЕЦ,
	|	ЗаявкаРаботы.омг_Набор";
	
	Запрос.УстановитьПараметр("Заявка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Движения.омг_НоменклатураЗаявокДляОказаний.Загрузить(РезультатЗапроса.Выгрузить()); 
	Движения.омг_НоменклатураЗаявокДляПриемов.Загрузить(РезультатЗапроса.Выгрузить());
	// омг_НоменклатураЗаявокДляОказаний и приемов
	///////////////////////////////////////////////////////
	
	///////////////////////////////////////////////////////
	// омг_НоменклатураИКлиентыПоСтраховым    
	Если ЗначениеЗаполнено(омг_СтраховаяПрограмма) и не Состояние = Справочники.ВидыСостоянийЗаявок.Отменена Тогда
		Движения.омг_НоменклатураИКлиентыПоСтраховым.Записывать = Истина;
		
		Номенклатуры = Работы.Выгрузить(,"Номенклатура"); 
		Номенклатуры.Свернуть("Номенклатура"); 
		
		Для каждого строкаНоменклатуры из Номенклатуры Цикл
			Если ЗначениеЗаполнено(строкаНоменклатуры.Номенклатура) Тогда
				Движение = Движения.омг_НоменклатураИКлиентыПоСтраховым.Добавить();
				Движение.Клиент = Клиент;
				Движение.Номенклатура = строкаНоменклатуры.Номенклатура;
				Движение.СтраховаяПрограмма = омг_СтраховаяПрограмма; 
				Движение.Заявка = Ссылка;
				Движение.Период = Дата;  
			КонецЕсли;
			
		КонецЦикла;	
		
	КонецЕсли;
	
	// омг_НоменклатураИКлиентыПоСтраховым 
	///////////////////////////////////////////////////////
		
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)    
	
	Набор = РегистрыСведений.омг_НоменклатураЗаявок.СоздатьНаборЗаписей(); 
	Набор.Отбор.Регистратор.Установить(ЭтотОбъект.Ссылка);		
	Набор.Записать(); 
	
	омг_МедицинскаяДеятельность.КонтрольПоНоменклатуре(ЭтотОбъект, Истина);
	
КонецПроцедуры

#КонецОбласти
